{"lang":"Rust","fullPath":"/expressions/method-call-expr","category":"expressions","title":"method-call-expr","url":"https://doc.rust-lang.org/stable/reference/expressions/method-call-expr.html","markdown":"# [Method-call expressions](#method-call-expressions)\n\n> **Syntax**  \n> _MethodCallExpression_ :  \n> [_Expression_](../expressions.html) `.` [_PathExprSegment_](../paths.html#paths-in-expressions) `(`[_CallParams_](call-expr.html)? `)`\n\nA _method call_ consists of an expression (the _receiver_) followed by a single dot, an expression path segment, and a parenthesized expression-list. Method calls are resolved to associated [methods](../items/associated-items.html#methods) on specific traits, either statically dispatching to a method if the exact `self`\\-type of the left-hand-side is known, or dynamically dispatching if the left-hand-side expression is an indirect [trait object](../types/trait-object.html).\n\n```rust\n#![allow(unused)]\nfn main() {\nlet pi: Result<f32, _> = \"3.14\".parse();\nlet log_pi = pi.unwrap_or(1.0).log(2.72);\nassert!(1.14 < log_pi && log_pi < 1.15)\n}\n```\n\nWhen looking up a method call, the receiver may be automatically dereferenced or borrowed in order to call a method. This requires a more complex lookup process than for other functions, since there may be a number of possible methods to call. The following procedure is used:\n\nThe first step is to build a list of candidate receiver types. Obtain these by repeatedly [dereferencing](operator-expr.html#the-dereference-operator) the receiver expression's type, adding each type encountered to the list, then finally attempting an [unsized coercion](../type-coercions.html#unsized-coercions) at the end, and adding the result type if that is successful. Then, for each candidate `T`, add `&T` and `&mut T` to the list immediately after `T`.\n\nFor instance, if the receiver has type `Box<[i32;2]>`, then the candidate types will be `Box<[i32;2]>`, `&Box<[i32;2]>`, `&mut Box<[i32;2]>`, `[i32; 2]` (by dereferencing), `&[i32; 2]`, `&mut [i32; 2]`, `[i32]` (by unsized coercion), `&[i32]`, and finally `&mut [i32]`.\n\nThen, for each candidate type `T`, search for a [visible](../visibility-and-privacy.html) method with a receiver of that type in the following places:\n\n1. `T`'s inherent methods (methods implemented directly on `T`).\n2. Any of the methods provided by a [visible](../visibility-and-privacy.html) trait implemented by `T`. If `T` is a type parameter, methods provided by trait bounds on `T` are looked up first. Then all remaining methods in scope are looked up.\n\n> Note: the lookup is done for each type in order, which can occasionally lead to surprising results. The below code will print \"In trait impl!\", because `&self` methods are looked up first, the trait method is found before the struct's `&mut self` method is found.\n> \n> ```rust\n> struct Foo {}\n> \n> trait Bar {\n>  fn bar(&self);\n> }\n> \n> impl Foo {\n>  fn bar(&mut self) {\n>    println!(\"In struct impl!\")\n>  }\n> }\n> \n> impl Bar for Foo {\n>  fn bar(&self) {\n>    println!(\"In trait impl!\")\n>  }\n> }\n> \n> fn main() {\n>  let mut f = Foo{};\n>  f.bar();\n> }\n> ```\n\nIf this results in multiple possible candidates, then it is an error, and the receiver must be [converted](call-expr.html#disambiguating-function-calls) to an appropriate receiver type to make the method call.\n\nThis process does not take into account the mutability or lifetime of the receiver, or whether a method is `unsafe`. Once a method is looked up, if it can't be called for one (or more) of those reasons, the result is a compiler error.\n\nIf a step is reached where there is more than one possible method, such as where generic methods or traits are considered the same, then it is a compiler error. These cases require a [disambiguating function call syntax](call-expr.html#disambiguating-function-calls) for method and function invocation.\n\n> **Edition Differences**: Before the 2021 edition, during the search for visible methods, if the candidate receiver type is an [array type](../types/array.html), methods provided by the standard library [IntoIterator](../../std/iter/trait.IntoIterator.html) trait are ignored.\n> \n> The edition used for this purpose is determined by the token representing the method name.\n> \n> This special case may be removed in the future.\n\n_**Warning:**_ For [trait objects](../types/trait-object.html), if there is an inherent method of the same name as a trait method, it will give a compiler error when trying to call the method in a method call expression. Instead, you can call the method using [disambiguating function call syntax](call-expr.html#disambiguating-function-calls), in which case it calls the trait method, not the inherent method. There is no way to call the inherent method. Just don't define inherent methods on trait objects with the same name as a trait method and you'll be fine.\n\n[ ](../expressions/call-expr.html \"Previous chapter\") [ ](../expressions/field-expr.html \"Next chapter\") "}