{"lang":"Rust","fullPath":"/types/impl-trait","category":"types","title":"impl-trait","url":"https://doc.rust-lang.org/stable/reference/types/impl-trait.html","markdown":"# [Impl trait](#impl-trait)\n\n> **Syntax**  \n> _ImplTraitType_ : `impl` [_TypeParamBounds_](../trait-bounds.html)\n> \n> _ImplTraitTypeOneBound_ : `impl` [_TraitBound_](../trait-bounds.html)\n\n`impl Trait` provides ways to specify unnamed but concrete types that implement a specific trait. It can appear in two sorts of places: argument position (where it can act as an anonymous type parameter to functions), and return position (where it can act as an abstract return type).\n\n```rust\n#![allow(unused)]\nfn main() {\ntrait Trait {}\nimpl Trait for () {}\n\n// argument position: anonymous type parameter\nfn foo(arg: impl Trait) {\n}\n\n// return position: abstract return type\nfn bar() -> impl Trait {\n}\n}\n```\n\n## [Anonymous type parameters](#anonymous-type-parameters)\n\n> Note: This is often called \"impl Trait in argument position\". (The term \"parameter\" is more correct here, but \"impl Trait in argument position\" is the phrasing used during the development of this feature, and it remains in parts of the implementation.)\n\nFunctions can use `impl` followed by a set of trait bounds to declare a parameter as having an anonymous type. The caller must provide a type that satisfies the bounds declared by the anonymous type parameter, and the function can only use the methods available through the trait bounds of the anonymous type parameter.\n\nFor example, these two forms are almost equivalent:\n\n```rust\ntrait Trait {}\n\n// generic type parameter\nfn foo<T: Trait>(arg: T) {\n}\n\n// impl Trait in argument position\nfn foo(arg: impl Trait) {\n}\n```\n\nThat is, `impl Trait` in argument position is syntactic sugar for a generic type parameter like `<T: Trait>`, except that the type is anonymous and doesn't appear in the [_GenericParams_](../items/generics.html) list.\n\n> **Note:**For function parameters, generic type parameters and `impl Trait` are not exactly equivalent. With a generic parameter such as `<T: Trait>`, the caller has the option to explicitly specify the generic argument for `T` at the call site using [_GenericArgs_](../paths.html#paths-in-expressions), for example, `foo::<usize>(1)`. If `impl Trait` is the type of _any_ function parameter, then the caller can't ever provide any generic arguments when calling that function. This includes generic arguments for the return type or any const generics.\n> \n> Therefore, changing the function signature from either one to the other can constitute a breaking change for the callers of a function.\n\n## [Abstract return types](#abstract-return-types)\n\n> Note: This is often called \"impl Trait in return position\".\n\nFunctions can use `impl Trait` to return an abstract return type. These types stand in for another concrete type where the caller may only use the methods declared by the specified `Trait`. Each possible return value from the function must resolve to the same concrete type.\n\n`impl Trait` in return position allows a function to return an unboxed abstract type. This is particularly useful with [closures](closure.html) and iterators. For example, closures have a unique, un-writable type. Previously, the only way to return a closure from a function was to use a [trait object](trait-object.html):\n\n```rust\n#![allow(unused)]\nfn main() {\nfn returns_closure() -> Box<dyn Fn(i32) -> i32> {\n    Box::new(|x| x + 1)\n}\n}\n```\n\nThis could incur performance penalties from heap allocation and dynamic dispatch. It wasn't possible to fully specify the type of the closure, only to use the `Fn` trait. That means that the trait object is necessary. However, with `impl Trait`, it is possible to write this more simply:\n\n```rust\n#![allow(unused)]\nfn main() {\nfn returns_closure() -> impl Fn(i32) -> i32 {\n    |x| x + 1\n}\n}\n```\n\nwhich also avoids the drawbacks of using a boxed trait object.\n\nSimilarly, the concrete types of iterators could become very complex, incorporating the types of all previous iterators in a chain. Returning `impl Iterator` means that a function only exposes the `Iterator` trait as a bound on its return type, instead of explicitly specifying all of the other iterator types involved.\n\n### [Differences between generics and impl Trait in return position](#differences-between-generics-and-impl-trait-in-return-position)\n\nIn argument position, `impl Trait` is very similar in semantics to a generic type parameter. However, there are significant differences between the two in return position. With `impl Trait`, unlike with a generic type parameter, the function chooses the return type, and the caller cannot choose the return type.\n\nThe function:\n\n```rust\nfn foo<T: Trait>() -> T {\n```\n\nallows the caller to determine the return type, `T`, and the function returns that type.\n\nThe function:\n\n```rust\nfn foo() -> impl Trait {\n```\n\ndoesn't allow the caller to determine the return type. Instead, the function chooses the return type, but only promises that it will implement `Trait`.\n\n## [Limitations](#limitations)\n\n`impl Trait` can only appear as a parameter or return type of a free or inherent function. It cannot appear inside implementations of traits, nor can it be the type of a let binding or appear inside a type alias.\n\n[ ](../types/trait-object.html \"Previous chapter\") [ ](../types/parameters.html \"Next chapter\") "}