{"lang":"Rust","fullPath":"/glossary","category":"","title":"glossary.html","url":"https://doc.rust-lang.org/stable/reference/glossary.html","markdown":"# [Glossary](#glossary)\n\n### [Abstract syntax tree](#abstract-syntax-tree)\n\nAn ‘abstract syntax tree’, or ‘AST’, is an intermediate representation of the structure of the program when the compiler is compiling it.\n\n### [Alignment](#alignment)\n\nThe alignment of a value specifies what addresses values are preferred to start at. Always a power of two. References to a value must be aligned.[More](type-layout.html#size-and-alignment).\n\n### [Arity](#arity)\n\nArity refers to the number of arguments a function or operator takes. For some examples, `f(2, 3)` and `g(4, 6)` have arity 2, while `h(8, 2, 6)`has arity 3\\. The `!` operator has arity 1.\n\n### [Array](#array)\n\nAn array, sometimes also called a fixed-size array or an inline array, is a value describing a collection of elements, each selected by an index that can be computed at run time by the program. It occupies a contiguous region of memory.\n\n### [Associated item](#associated-item)\n\nAn associated item is an item that is associated with another item. Associated items are defined in [implementations](items/implementations.html) and declared in [traits](items/traits.html). Only functions, constants, and type aliases can be associated. Contrast to a [free item](#free-item).\n\n### [Blanket implementation](#blanket-implementation)\n\nAny implementation where a type appears [uncovered](#uncovered-type). `impl<T> Foo for T`, `impl<T> Bar<T> for T`, `impl<T> Bar<Vec<T>> for T`, and `impl<T> Bar<T> for Vec<T>` are considered blanket impls. However, `impl<T> Bar<Vec<T>> for Vec<T>` is not a blanket impl, as all instances of `T` which appear in this `impl`are covered by `Vec`.\n\n### [Bound](#bound)\n\nBounds are constraints on a type or trait. For example, if a bound is placed on the argument a function takes, types passed to that function must abide by that constraint.\n\n### [Combinator](#combinator)\n\nCombinators are higher-order functions that apply only functions and earlier defined combinators to provide a result from its arguments. They can be used to manage control flow in a modular fashion.\n\n### [Crate](#crate)\n\nA crate is the unit of compilation and linking. There are different [types of crates](linkage.html), such as libraries or executables. Crates may link and refer to other library crates, called external crates. A crate has a self-contained tree of[modules](items/modules.html), starting from an unnamed root module called the crate root. [Items](items.html)may be made visible to other crates by marking them as public in the crate root, including through [paths](paths.html) of public modules.[More](crates-and-source-files.html).\n\n### [Dispatch](#dispatch)\n\nDispatch is the mechanism to determine which specific version of code is actually run when it involves polymorphism. Two major forms of dispatch are static dispatch and dynamic dispatch. While Rust favors static dispatch, it also supports dynamic dispatch through a mechanism called ‘trait objects’.\n\n### [Dynamically sized type](#dynamically-sized-type)\n\nA dynamically sized type (DST) is a type without a statically known size or alignment.\n\n### [Entity](#entity)\n\nAn [_entity_](names.html) is a language construct that can be referred to in some way within the source program, usually via a [path](paths.html). Entities include[types](types.html), [items](items.html), [generic parameters](items/generics.html), [variable bindings](patterns.html), [loop labels](tokens.html#lifetimes-and-loop-labels),[lifetimes](tokens.html#lifetimes-and-loop-labels), [fields](expressions/field-expr.html), [attributes](attributes.html), and [lints](attributes/diagnostics.html#lint-check-attributes).\n\n### [Expression](#expression)\n\nAn expression is a combination of values, constants, variables, operators and functions that evaluate to a single value, with or without side-effects.\n\nFor example, `2 + (3 * 4)` is an expression that returns the value 14.\n\n### [Free item](#free-item)\n\nAn [item](items.html) that is not a member of an [implementation](items/implementations.html), such as a _free function_ or a _free const_. Contrast to an [associated item](#associated-item).\n\n### [Fundamental traits](#fundamental-traits)\n\nA fundamental trait is one where adding an impl of it for an existing type is a breaking change. The `Fn` traits and `Sized` are fundamental.\n\n### [Fundamental type constructors](#fundamental-type-constructors)\n\nA fundamental type constructor is a type where implementing a [blanket implementation](#blanket-implementation) over it is a breaking change. `&`, `&mut`, `Box`, and `Pin` are fundamental.\n\nAny time a type `T` is considered [local](#local-type), `&T`, `&mut T`, `Box<T>`, and `Pin<T>`are also considered local. Fundamental type constructors cannot [cover](#uncovered-type) other types. Any time the term \"covered type\" is used, the `T` in `&T`, `&mut T`, `Box<T>`, and `Pin<T>` is not considered covered.\n\n### [Inhabited](#inhabited)\n\nA type is inhabited if it has constructors and therefore can be instantiated. An inhabited type is not \"empty\" in the sense that there can be values of the type. Opposite of[Uninhabited](#uninhabited).\n\n### [Inherent implementation](#inherent-implementation)\n\nAn [implementation](items/implementations.html) that applies to a nominal type, not to a trait-type pair.[More](items/implementations.html#inherent-implementations).\n\n### [Inherent method](#inherent-method)\n\nA [method](items/associated-items.html#methods) defined in an [inherent implementation](items/implementations.html#inherent-implementations), not in a trait implementation.\n\n### [Initialized](#initialized)\n\nA variable is initialized if it has been assigned a value and hasn't since been moved from. All other memory locations are assumed to be uninitialized. Only unsafe Rust can create a memory location without initializing it.\n\n### [Local trait](#local-trait)\n\nA `trait` which was defined in the current crate. A trait definition is local or not independent of applied type arguments. Given `trait Foo<T, U>`,`Foo` is always local, regardless of the types substituted for `T` and `U`.\n\n### [Local type](#local-type)\n\nA `struct`, `enum`, or `union` which was defined in the current crate. This is not affected by applied type arguments. `struct Foo` is considered local, but`Vec<Foo>` is not. `LocalType<ForeignType>` is local. Type aliases do not affect locality.\n\n### [Module](#module)\n\nA module is a container for zero or more [items](items.html). Modules are organized in a tree, starting from an unnamed module at the root called the crate root or the root module. [Paths](paths.html) may be used to refer to items from other modules, which may be restricted by [visibility rules](visibility-and-privacy.html).[More](items/modules.html)\n\n### [Name](#name)\n\nA [_name_](names.html) is an [identifier](identifiers.html) or [lifetime or loop label](tokens.html#lifetimes-and-loop-labels) that refers to an[entity](#entity). A _name binding_ is when an entity declaration introduces an identifier or label associated with that entity. [Paths](paths.html), identifiers, and labels are used to refer to an entity.\n\n### [Name resolution](#name-resolution)\n\n[_Name resolution_](names/name-resolution.html) is the compile-time process of tying [paths](paths.html),[identifiers](identifiers.html), and [labels](tokens.html#lifetimes-and-loop-labels) to [entity](#entity) declarations.\n\n### [Namespace](#namespace)\n\nA _namespace_ is a logical grouping of declared [names](#name) based on the kind of [entity](#entity) the name refers to. Namespaces allow the occurrence of a name in one namespace to not conflict with the same name in another namespace.\n\nWithin a namespace, names are organized in a hierarchy, where each level of the hierarchy has its own collection of named entities.\n\n### [Nominal types](#nominal-types)\n\nTypes that can be referred to by a path directly. Specifically [enums](items/enumerations.html),[structs](items/structs.html), [unions](items/unions.html), and [trait objects](types/trait-object.html).\n\n### [Object safe traits](#object-safe-traits)\n\n[Traits](items/traits.html) that can be used as [trait objects](types/trait-object.html). Only traits that follow specific[rules](items/traits.html#object-safety) are object safe.\n\n### [Path](#path)\n\nA [_path_](paths.html) is a sequence of one or more path segments used to refer to an[entity](#entity) in the current scope or other levels of a[namespace](#namespace) hierarchy.\n\n### [Prelude](#prelude)\n\nPrelude, or The Rust Prelude, is a small collection of items - mostly traits - that are imported into every module of every crate. The traits in the prelude are pervasive.\n\n### [Scope](#scope)\n\nA [_scope_](names/scopes.html) is the region of source text where a named [entity](#entity) may be referenced with that name.\n\n### [Scrutinee](#scrutinee)\n\nA scrutinee is the expression that is matched on in `match` expressions and similar pattern matching constructs. For example, in `match x { A => 1, B => 2 }`, the expression `x` is the scrutinee.\n\n### [Size](#size)\n\nThe size of a value has two definitions.\n\nThe first is that it is how much memory must be allocated to store that value.\n\nThe second is that it is the offset in bytes between successive elements in an array with that item type.\n\nIt is a multiple of the alignment, including zero. The size can change depending on compiler version (as new optimizations are made) and target platform (similar to how `usize` varies per-platform).\n\n[More](type-layout.html#size-and-alignment).\n\n### [Slice](#slice)\n\nA slice is dynamically-sized view into a contiguous sequence, written as `[T]`.\n\nIt is often seen in its borrowed forms, either mutable or shared. The shared slice type is `&[T]`, while the mutable slice type is `&mut [T]`, where `T` represents the element type.\n\n### [Statement](#statement)\n\nA statement is the smallest standalone element of a programming language that commands a computer to perform an action.\n\n### [String literal](#string-literal)\n\nA string literal is a string stored directly in the final binary, and so will be valid for the `'static` duration.\n\nIts type is `'static` duration borrowed string slice, `&'static str`.\n\n### [String slice](#string-slice)\n\nA string slice is the most primitive string type in Rust, written as `str`. It is often seen in its borrowed forms, either mutable or shared. The shared string slice type is `&str`, while the mutable string slice type is `&mut str`.\n\nStrings slices are always valid UTF-8.\n\n### [Trait](#trait)\n\nA trait is a language item that is used for describing the functionalities a type must provide. It allows a type to make certain promises about its behavior.\n\nGeneric functions and generic structs can use traits to constrain, or bound, the types they accept.\n\n### [Turbofish](#turbofish)\n\nPaths with generic parameters in expressions must prefix the opening brackets with a `::`. Combined with the angular brackets for generics, this looks like a fish `::<>`. As such, this syntax is colloquially referred to as turbofish syntax.\n\nExamples:\n\n```rust\n#![allow(unused)]\nfn main() {\nlet ok_num = Ok::<_, ()>(5);\nlet vec = [1, 2, 3].iter().map(|n| n * 2).collect::<Vec<_>>();\n}\n```\n\nThis `::` prefix is required to disambiguate generic paths with multiple comparisons in a comma-separate list. See [the bastion of the turbofish](https://github.com/rust-lang/rust/blob/1.58.0/src/test/ui/parser/bastion-of-the-turbofish.rs) for an example where not having the prefix would be ambiguous.\n\n### [Uncovered type](#uncovered-type)\n\nA type which does not appear as an argument to another type. For example,`T` is uncovered, but the `T` in `Vec<T>` is covered. This is only relevant for type arguments.\n\n### [Undefined behavior](#undefined-behavior)\n\nCompile-time or run-time behavior that is not specified. This may result in, but is not limited to: process termination or corruption; improper, incorrect, or unintended computation; or platform-specific results.[More](behavior-considered-undefined.html).\n\n### [Uninhabited](#uninhabited)\n\nA type is uninhabited if it has no constructors and therefore can never be instantiated. An uninhabited type is \"empty\" in the sense that there are no values of the type. The canonical example of an uninhabited type is the [never type](types/never.html) `!`, or an enum with no variants`enum Never { }`. Opposite of [Inhabited](#inhabited).\n\n[ ](influences.html \"Previous chapter\") "}