{"lang":"Rust","fullPath":"/introduction","category":"","title":"introduction.html","url":"https://doc.rust-lang.org/stable/reference/introduction.html","markdown":"# [Introduction](#introduction)\n\nThis book is the primary reference for the Rust programming language. It provides three kinds of material:\n\n* Chapters that informally describe each language construct and their use.\n* Chapters that informally describe the memory model, concurrency model, runtime services, linkage model, and debugging facilities.\n* Appendix chapters providing rationale and references to languages that influenced the design.\n\nWarning: This book is incomplete. Documenting everything takes a while. See the [GitHub issues](https://github.com/rust-lang/reference/issues) for what is not documented in this book.\n\n## [Rust releases](#rust-releases)\n\nRust has a new language release every six weeks. The first stable release of the language was Rust 1.0.0, followed by Rust 1.1.0 and so on. Tools (`rustc`, `cargo`, etc.) and documentation ([Standard library](../std/index.html), this book, etc.) are released with the language release.\n\nThe latest release of this book, matching the latest Rust version, can always be found at <https://doc.rust-lang.org/reference/>. Prior versions can be found by adding the Rust version before the \"reference\" directory. For example, the Reference for Rust 1.49.0 is located at <https://doc.rust-lang.org/1.49.0/reference/>.\n\n## [What _The Reference_ is not](#what-the-reference-is-not)\n\nThis book does not serve as an introduction to the language. Background familiarity with the language is assumed. A separate [book](../book/index.html) is available to help acquire such background familiarity.\n\nThis book also does not serve as a reference to the [standard library](../std/index.html) included in the language distribution. Those libraries are documented separately by extracting documentation attributes from their source code. Many of the features that one might expect to be language features are library features in Rust, so what you're looking for may be there, not here.\n\nSimilarly, this book does not usually document the specifics of `rustc` as a tool or of Cargo.`rustc` has its own [book](../rustc/index.html). Cargo has a [book](../cargo/index.html) that contains a [reference](../cargo/reference/index.html). There are a few pages such as [linkage](linkage.html) that still describe how `rustc` works.\n\nThis book also only serves as a reference to what is available in stable Rust. For unstable features being worked on, see the [Unstable Book](https://doc.rust-lang.org/nightly/unstable-book/).\n\nRust compilers, including `rustc`, will perform optimizations. The reference does not specify what optimizations are allowed or disallowed. Instead, think of the compiled program as a black box. You can only probe by running it, feeding it input and observing its output. Everything that happens that way must conform to what the reference says.\n\nFinally, this book is not normative. It may include details that are specific to `rustc` itself, and should not be taken as a specification for the Rust language. We intend to produce such a book someday, and until then, the reference is the closest thing we have to one.\n\n## [How to use this book](#how-to-use-this-book)\n\nThis book does not assume you are reading this book sequentially. Each chapter generally can be read standalone, but will cross-link to other chapters for facets of the language they refer to, but do not discuss.\n\nThere are two main ways to read this document.\n\nThe first is to answer a specific question. If you know which chapter answers that question, you can jump to that chapter in the table of contents. Otherwise, you can press `s` or click the magnifying glass on the top bar to search for keywords related to your question. For example, say you wanted to know when a temporary value created in a let statement is dropped. If you didn't already know that the [lifetime of temporaries](expressions.html#temporaries) is defined in the [expressions chapter](expressions.html), you could search \"temporary let\" and the first search result will take you to that section.\n\nThe second is to generally improve your knowledge of a facet of the language. In that case, just browse the table of contents until you see something you want to know more about, and just start reading. If a link looks interesting, click it, and read about that section.\n\nThat said, there is no wrong way to read this book. Read it however you feel helps you best.\n\n### [Conventions](#conventions)\n\nLike all technical books, this book has certain conventions in how it displays information. These conventions are documented here.\n\n* Statements that define a term contain that term in _italics_. Whenever that term is used outside of that chapter, it is usually a link to the section that has this definition.  \nAn _example term_ is an example of a term being defined.\n* Differences in the language by which edition the crate is compiled under are in a blockquote that start with the words \"Edition Differences:\" in **bold**.  \n> **Edition Differences**: In the 2015 edition, this syntax is valid that is disallowed as of the 2018 edition.\n* Notes that contain useful information about the state of the book or point out useful, but mostly out of scope, information are in blockquotes that start with the word \"Note:\" in **bold**.  \n> **Note**: This is an example note.\n* Warnings that show unsound behavior in the language or possibly confusing interactions of language features are in a special warning box.  \nWarning: This is an example warning.\n* Code snippets inline in the text are inside `<code>` tags.  \nLonger code examples are in a syntax highlighted box that has controls for copying, executing, and showing hidden lines in the top right corner.  \n```rust  \n// This is a hidden line.  \nfn main() {  \n    println!(\"This is a code example\");  \n}  \n```  \nAll examples are written for the latest edition unless otherwise stated.\n* The grammar and lexical structure is in blockquotes with either \"Lexer\" or \"Syntax\" in **bold superscript** as the first line.  \n> **Syntax**  \n> _ExampleGrammar_:  \n> `~` [_Expression_](expressions.html)  \n> | `box` [_Expression_](expressions.html)  \nSee [Notation](notation.html) for more detail.\n\n## [Contributing](#contributing)\n\nWe welcome contributions of all kinds.\n\nYou can contribute to this book by opening an issue or sending a pull request to [the Rust Reference repository](https://github.com/rust-lang/reference/). If this book does not answer your question, and you think its answer is in scope of it, please do not hesitate to [file an issue](https://github.com/rust-lang/reference/issues) or ask about it in the `t-lang/doc` stream on [Zulip](https://rust-lang.zulipchat.com/#narrow/stream/237824-t-lang.2Fdoc). Knowing what people use this book for the most helps direct our attention to making those sections the best that they can be. We also want the reference to be as normative as possible, so if you see anything that is wrong or is non-normative but not specifically called out, please also [file an issue](https://github.com/rust-lang/reference/issues).\n\n[ ](notation.html \"Next chapter\") "}