{"lang":"Rust","fullPath":"/macros-by-example","category":"","title":"macros-by-example.html","url":"https://doc.rust-lang.org/stable/reference/macros-by-example.html","markdown":"# [Macros By Example](#macros-by-example)\n\n> **Syntax**  \n> _MacroRulesDefinition_ :  \n> `macro_rules` `!` [IDENTIFIER](identifiers.html) _MacroRulesDef_\n> \n> _MacroRulesDef_ :  \n> `(` _MacroRules_ `)` `;`  \n> | `[` _MacroRules_ `]` `;`  \n> | `{` _MacroRules_ `}`\n> \n> _MacroRules_ :  \n> _MacroRule_ ( `;` _MacroRule_ )\\* `;`?\n> \n> _MacroRule_ :  \n> _MacroMatcher_ `=>` _MacroTranscriber_\n> \n> _MacroMatcher_ :  \n> `(` _MacroMatch_\\* `)`  \n> | `[` _MacroMatch_\\* `]`  \n> | `{` _MacroMatch_\\* `}`\n> \n> _MacroMatch_ :  \n> [_Token_](tokens.html)_except `$` and [delimiters](tokens.html#delimiters)_  \n> | _MacroMatcher_  \n> | `$` ( [IDENTIFIER\\_OR\\_KEYWORD](identifiers.html) _except `crate`_ | [RAW\\_IDENTIFIER](identifiers.html) | `_` ) `:` _MacroFragSpec_  \n> | `$` `(` _MacroMatch_+ `)` _MacroRepSep_? _MacroRepOp_\n> \n> _MacroFragSpec_ :  \n> `block` | `expr` | `ident` | `item` | `lifetime` | `literal`  \n> | `meta` | `pat` | `pat_param` | `path` | `stmt` | `tt` | `ty` | `vis`\n> \n> _MacroRepSep_ :  \n> [_Token_](tokens.html)_except [delimiters](tokens.html#delimiters) and MacroRepOp_\n> \n> _MacroRepOp_ :  \n> `*` | `+` | `?`\n> \n> _MacroTranscriber_ :  \n> [_DelimTokenTree_](macros.html)\n\n`macro_rules` allows users to define syntax extension in a declarative way. We call such extensions \"macros by example\" or simply \"macros\".\n\nEach macro by example has a name, and one or more _rules_. Each rule has two parts: a _matcher_, describing the syntax that it matches, and a _transcriber_, describing the syntax that will replace a successfully matched invocation. Both the matcher and the transcriber must be surrounded by delimiters. Macros can expand to expressions, statements, items (including traits, impls, and foreign items), types, or patterns.\n\n## [Transcribing](#transcribing)\n\nWhen a macro is invoked, the macro expander looks up macro invocations by name, and tries each macro rule in turn. It transcribes the first successful match; if this results in an error, then future matches are not tried. When matching, no lookahead is performed; if the compiler cannot unambiguously determine how to parse the macro invocation one token at a time, then it is an error. In the following example, the compiler does not look ahead past the identifier to see if the following token is a `)`, even though that would allow it to parse the invocation unambiguously:\n\n```rust\n#![allow(unused)]\nfn main() {\nmacro_rules! ambiguity {\n    ($($i:ident)* $j:ident) => { };\n}\n\nambiguity!(error); // Error: local ambiguity\n}\n```\n\nIn both the matcher and the transcriber, the `$` token is used to invoke special behaviours from the macro engine (described below in [Metavariables](#metavariables) and[Repetitions](#repetitions)). Tokens that aren't part of such an invocation are matched and transcribed literally, with one exception. The exception is that the outer delimiters for the matcher will match any pair of delimiters. Thus, for instance, the matcher `(())` will match `{()}` but not `{{}}`. The character`$` cannot be matched or transcribed literally.\n\n### [Forwarding a matched fragment](#forwarding-a-matched-fragment)\n\nWhen forwarding a matched fragment to another macro-by-example, matchers in the second macro will see an opaque AST of the fragment type. The second macro can't use literal tokens to match the fragments in the matcher, only a fragment specifier of the same type. The `ident`, `lifetime`, and `tt`fragment types are an exception, and _can_ be matched by literal tokens. The following illustrates this restriction:\n\n```rust\n#![allow(unused)]\nfn main() {\nmacro_rules! foo {\n    ($l:expr) => { bar!($l); }\n// ERROR:               ^^ no rules expected this token in macro call\n}\n\nmacro_rules! bar {\n    (3) => {}\n}\n\nfoo!(3);\n}\n```\n\nThe following illustrates how tokens can be directly matched after matching a`tt` fragment:\n\n```rust\n#![allow(unused)]\nfn main() {\n// compiles OK\nmacro_rules! foo {\n    ($l:tt) => { bar!($l); }\n}\n\nmacro_rules! bar {\n    (3) => {}\n}\n\nfoo!(3);\n}\n```\n\n## [Metavariables](#metavariables)\n\nIn the matcher, `$` _name_ `:` _fragment-specifier_ matches a Rust syntax fragment of the kind specified and binds it to the metavariable `$`_name_. Valid fragment specifiers are:\n\n* `item`: an [_Item_](items.html)\n* `block`: a [_BlockExpression_](expressions/block-expr.html)\n* `stmt`: a [_Statement_](statements.html) without the trailing semicolon (except for item statements that require semicolons)\n* `pat_param`: a [_PatternNoTopAlt_](patterns.html)\n* `pat`: at least any [_PatternNoTopAlt_](patterns.html), and possibly more depending on edition\n* `expr`: an [_Expression_](expressions.html)\n* `ty`: a [_Type_](types.html#type-expressions)\n* `ident`: an [IDENTIFIER\\_OR\\_KEYWORD](identifiers.html) or [RAW\\_IDENTIFIER](identifiers.html)\n* `path`: a [_TypePath_](paths.html#paths-in-types) style path\n* `tt`: a [_TokenTree_](macros.html#macro-invocation) (a single [token](tokens.html) or tokens in matching delimiters `()`, `[]`, or `{}`)\n* `meta`: an [_Attr_](attributes.html), the contents of an attribute\n* `lifetime`: a [LIFETIME\\_TOKEN](tokens.html#lifetimes-and-loop-labels)\n* `vis`: a possibly empty [_Visibility_](visibility-and-privacy.html) qualifier\n* `literal`: matches `-`?[_LiteralExpression_](expressions/literal-expr.html)\n\nIn the transcriber, metavariables are referred to simply by `$`_name_, since the fragment kind is specified in the matcher. Metavariables are replaced with the syntax element that matched them. The keyword metavariable `$crate` can be used to refer to the current crate; see [Hygiene](#hygiene) below. Metavariables can be transcribed more than once or not at all.\n\nFor reasons of backwards compatibility, though `_` [is also an expression](expressions/underscore-expr.html), a standalone underscore is not matched by the `expr` fragment specifier. However, `_` is matched by the `expr` fragment specifier when it appears as a subexpression.\n\n> **Edition Differences**: Starting with the 2021 edition, `pat` fragment-specifiers match top-level or-patterns (that is, they accept [_Pattern_](patterns.html)).\n> \n> Before the 2021 edition, they match exactly the same fragments as `pat_param` (that is, they accept [_PatternNoTopAlt_](patterns.html)).\n> \n> The relevant edition is the one in effect for the `macro_rules!` definition.\n\n## [Repetitions](#repetitions)\n\nIn both the matcher and transcriber, repetitions are indicated by placing the tokens to be repeated inside `$(`…`)`, followed by a repetition operator, optionally with a separator token between. The separator token can be any token other than a delimiter or one of the repetition operators, but `;` and `,` are the most common. For instance, `$( $i:ident ),*` represents any number of identifiers separated by commas. Nested repetitions are permitted.\n\nThe repetition operators are:\n\n* `*` — indicates any number of repetitions.\n* `+` — indicates any number but at least one.\n* `?` — indicates an optional fragment with zero or one occurrences.\n\nSince `?` represents at most one occurrence, it cannot be used with a separator.\n\nThe repeated fragment both matches and transcribes to the specified number of the fragment, separated by the separator token. Metavariables are matched to every repetition of their corresponding fragment. For instance, the `$( $i:ident ),*` example above matches `$i` to all of the identifiers in the list.\n\nDuring transcription, additional restrictions apply to repetitions so that the compiler knows how to expand them properly:\n\n1. A metavariable must appear in exactly the same number, kind, and nesting order of repetitions in the transcriber as it did in the matcher. So for the matcher `$( $i:ident ),*`, the transcribers `=> { $i }`,`=> { $( $( $i)* )* }`, and `=> { $( $i )+ }` are all illegal, but`=> { $( $i );* }` is correct and replaces a comma-separated list of identifiers with a semicolon-separated list.\n2. Each repetition in the transcriber must contain at least one metavariable to decide how many times to expand it. If multiple metavariables appear in the same repetition, they must be bound to the same number of fragments. For instance, `( $( $i:ident ),* ; $( $j:ident ),* ) => (( $( ($i,$j) ),* ))` must bind the same number of `$i` fragments as `$j` fragments. This means that invoking the macro with `(a, b, c; d, e, f)` is legal and expands to`((a,d), (b,e), (c,f))`, but `(a, b, c; d, e)` is illegal because it does not have the same number. This requirement applies to every layer of nested repetitions.\n\n## [Scoping, Exporting, and Importing](#scoping-exporting-and-importing)\n\nFor historical reasons, the scoping of macros by example does not work entirely like items. Macros have two forms of scope: textual scope, and path-based scope. Textual scope is based on the order that things appear in source files, or even across multiple files, and is the default scoping. It is explained further below. Path-based scope works exactly the same way that item scoping does. The scoping, exporting, and importing of macros is controlled largely by attributes.\n\nWhen a macro is invoked by an unqualified identifier (not part of a multi-part path), it is first looked up in textual scoping. If this does not yield any results, then it is looked up in path-based scoping. If the macro's name is qualified with a path, then it is only looked up in path-based scoping.\n\n```rust\nuse lazy_static::lazy_static; // Path-based import.\n\nmacro_rules! lazy_static { // Textual definition.\n    (lazy) => {};\n}\n\nlazy_static!{lazy} // Textual lookup finds our macro first.\nself::lazy_static!{} // Path-based lookup ignores our macro, finds imported one.\n```\n\n### [Textual Scope](#textual-scope)\n\nTextual scope is based largely on the order that things appear in source files, and works similarly to the scope of local variables declared with `let` except it also applies at the module level. When `macro_rules!` is used to define a macro, the macro enters the scope after the definition (note that it can still be used recursively, since names are looked up from the invocation site), up until its surrounding scope, typically a module, is closed. This can enter child modules and even span across multiple files:\n\n```rust\n//// src/lib.rs\nmod has_macro {\n    // m!{} // Error: m is not in scope.\n\n    macro_rules! m {\n        () => {};\n    }\n    m!{} // OK: appears after declaration of m.\n\n    mod uses_macro;\n}\n\n// m!{} // Error: m is not in scope.\n\n//// src/has_macro/uses_macro.rs\n\nm!{} // OK: appears after declaration of m in src/lib.rs\n```\n\nIt is not an error to define a macro multiple times; the most recent declaration will shadow the previous one unless it has gone out of scope.\n\n```rust\n#![allow(unused)]\nfn main() {\nmacro_rules! m {\n    (1) => {};\n}\n\nm!(1);\n\nmod inner {\n    m!(1);\n\n    macro_rules! m {\n        (2) => {};\n    }\n    // m!(1); // Error: no rule matches '1'\n    m!(2);\n\n    macro_rules! m {\n        (3) => {};\n    }\n    m!(3);\n}\n\nm!(1);\n}\n```\n\nMacros can be declared and used locally inside functions as well, and work similarly:\n\n```rust\n#![allow(unused)]\nfn main() {\nfn foo() {\n    // m!(); // Error: m is not in scope.\n    macro_rules! m {\n        () => {};\n    }\n    m!();\n}\n\n\n// m!(); // Error: m is not in scope.\n}\n```\n\n### [The macro\\_use attribute](#the-macro%5Fuse-attribute)\n\nThe _`macrouse` attribute_ has two purposes. First, it can be used to make a module's macro scope not end when the module is closed, by applying it to a module:\n\n```rust\n#![allow(unused)]\nfn main() {\n#[macro_use]\nmod inner {\n    macro_rules! m {\n        () => {};\n    }\n}\n\nm!();\n}\n```\n\nSecond, it can be used to import macros from another crate, by attaching it to an `extern crate` declaration appearing in the crate's root module. Macros imported this way are imported into the [macro\\_use prelude](names/preludes.html#macro%5Fuse-prelude), not textually, which means that they can be shadowed by any other name. While macros imported by `#[macro_use]` can be used before the import statement, in case of a conflict, the last macro imported wins. Optionally, a list of macros to import can be specified using the [_MetaListIdents_](attributes.html#meta-item-attribute-syntax) syntax; this is not supported when `#[macro_use]` is applied to a module.\n\n```rust\n#[macro_use(lazy_static)] // Or #[macro_use] to import all macros.\nextern crate lazy_static;\n\nlazy_static!{}\n// self::lazy_static!{} // Error: lazy_static is not defined in `self`\n```\n\nMacros to be imported with `#[macro_use]` must be exported with`#[macro_export]`, which is described below.\n\n### [Path-Based Scope](#path-based-scope)\n\nBy default, a macro has no path-based scope. However, if it has the`#[macro_export]` attribute, then it is declared in the crate root scope and can be referred to normally as such:\n\n```rust\n#![allow(unused)]\nfn main() {\nself::m!();\nm!(); // OK: Path-based lookup finds m in the current module.\n\nmod inner {\n    super::m!();\n    crate::m!();\n}\n\nmod mac {\n    #[macro_export]\n    macro_rules! m {\n        () => {};\n    }\n}\n}\n```\n\nMacros labeled with `#[macro_export]` are always `pub` and can be referred to by other crates, either by path or by `#[macro_use]` as described above.\n\n## [Hygiene](#hygiene)\n\nBy default, all identifiers referred to in a macro are expanded as-is, and are looked up at the macro's invocation site. This can lead to issues if a macro refers to an item or macro which isn't in scope at the invocation site. To alleviate this, the `$crate` metavariable can be used at the start of a path to force lookup to occur inside the crate defining the macro.\n\n```rust\n//// Definitions in the `helper_macro` crate.\n#[macro_export]\nmacro_rules! helped {\n    // () => { helper!() } // This might lead to an error due to 'helper' not being in scope.\n    () => { $crate::helper!() }\n}\n\n#[macro_export]\nmacro_rules! helper {\n    () => { () }\n}\n\n//// Usage in another crate.\n// Note that `helper_macro::helper` is not imported!\nuse helper_macro::helped;\n\nfn unit() {\n    helped!();\n}\n```\n\nNote that, because `$crate` refers to the current crate, it must be used with a fully qualified module path when referring to non-macro items:\n\n```rust\n#![allow(unused)]\nfn main() {\npub mod inner {\n    #[macro_export]\n    macro_rules! call_foo {\n        () => { $crate::inner::foo() };\n    }\n\n    pub fn foo() {}\n}\n}\n```\n\nAdditionally, even though `$crate` allows a macro to refer to items within its own crate when expanding, its use has no effect on visibility. An item or macro referred to must still be visible from the invocation site. In the following example, any attempt to invoke `call_foo!()` from outside its crate will fail because `foo()` is not public.\n\n```rust\n#![allow(unused)]\nfn main() {\n#[macro_export]\nmacro_rules! call_foo {\n    () => { $crate::foo() };\n}\n\nfn foo() {}\n}\n```\n\n> **Version & Edition Differences**: Prior to Rust 1.30, `$crate` and`local_inner_macros` (below) were unsupported. They were added alongside path-based imports of macros (described above), to ensure that helper macros did not need to be manually imported by users of a macro-exporting crate. Crates written for earlier versions of Rust that use helper macros need to be modified to use `$crate` or `local_inner_macros` to work well with path-based imports.\n\nWhen a macro is exported, the `#[macro_export]` attribute can have the`local_inner_macros` keyword added to automatically prefix all contained macro invocations with `$crate::`. This is intended primarily as a tool to migrate code written before `$crate` was added to the language to work with Rust 2018's path-based imports of macros. Its use is discouraged in new code.\n\n```rust\n#![allow(unused)]\nfn main() {\n#[macro_export(local_inner_macros)]\nmacro_rules! helped {\n    () => { helper!() } // Automatically converted to $crate::helper!().\n}\n\n#[macro_export]\nmacro_rules! helper {\n    () => { () }\n}\n}\n```\n\n## [Follow-set Ambiguity Restrictions](#follow-set-ambiguity-restrictions)\n\nThe parser used by the macro system is reasonably powerful, but it is limited in order to prevent ambiguity in current or future versions of the language. In particular, in addition to the rule about ambiguous expansions, a nonterminal matched by a metavariable must be followed by a token which has been decided can be safely used after that kind of match.\n\nAs an example, a macro matcher like `$i:expr [ , ]` could in theory be accepted in Rust today, since `[,]` cannot be part of a legal expression and therefore the parse would always be unambiguous. However, because `[` can start trailing expressions, `[` is not a character which can safely be ruled out as coming after an expression. If `[,]` were accepted in a later version of Rust, this matcher would become ambiguous or would misparse, breaking working code. Matchers like `$i:expr,` or `$i:expr;` would be legal, however, because `,` and`;` are legal expression separators. The specific rules are:\n\n* `expr` and `stmt` may only be followed by one of: `=>`, `,`, or `;`.\n* `pat_param` may only be followed by one of: `=>`, `,`, `=`, `|`, `if`, or `in`.\n* `pat` may only be followed by one of: `=>`, `,`, `=`, `if`, or `in`.\n* `path` and `ty` may only be followed by one of: `=>`, `,`, `=`, `|`, `;`,`:`, `>`, `>>`, `[`, `{`, `as`, `where`, or a macro variable of `block`fragment specifier.\n* `vis` may only be followed by one of: `,`, an identifier other than a non-raw `priv`, any token that can begin a type, or a metavariable with a`ident`, `ty`, or `path` fragment specifier.\n* All other fragment specifiers have no restrictions.\n\n> **Edition Differences**: Before the 2021 edition, `pat` may also be followed by `|`.\n\nWhen repetitions are involved, then the rules apply to every possible number of expansions, taking separators into account. This means:\n\n* If the repetition includes a separator, that separator must be able to follow the contents of the repetition.\n* If the repetition can repeat multiple times (`*` or `+`), then the contents must be able to follow themselves.\n* The contents of the repetition must be able to follow whatever comes before, and whatever comes after must be able to follow the contents of the repetition.\n* If the repetition can match zero times (`*` or `?`), then whatever comes after must be able to follow whatever comes before.\n\nFor more detail, see the [formal specification](macro-ambiguity.html).\n\n[ ](macros.html \"Previous chapter\") [ ](procedural-macros.html \"Next chapter\") "}